# Axis Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
CylindricalSurface..::..Axis Property
CylindricalSurface Class See Also
---
Axis of the cylinder. This is the Z axis of the local coordinate system associated with this cylinder.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public XYZ Axis { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Axis As XYZ
	Get
```

Visual C++
---
```text
public:
property XYZ^ Axis {
	XYZ^ get ();
}
```

# See Also
CylindricalSurface Class
Autodesk.Revit.DB Namespace